{ "subject": "Seventh Promise",
  "date": "07-19-2020",
  "content": "Carrie,\r\r\n\nI can still remember the day where I knew you were worth meeting. I was making 5lbs of pasta, as was customary (and still is). While cooking, I was listening to a 30-minute <a href=\"https://youtu.be/Hz6bzqfet0E/\">video</a> of this girl singing her heart out during her junior recital. She was incredible. I <i>had</i> to meet her.\r\n\r\nWe talked incessantly for weeks, even months, but could never seem to meet in person. I was not deterred. I could wait. Besides, it's not easy when you have 12 classes and who knows how many shows and events to attend to. I didn't lose hope. So I commenced with my plan to move the coversation forward. \"Context, pretext, and subtext with me?\" I messaged to you, followed by my phone number. You took the bait, and it wasn't long before we set a date. \r\n\r\nWhen we met, there was instant chemistry. The same chemistry we had over text was here and in full force. You were engaging, funny, smart, and not to mention, every bit as beautiful as I could have imagined. Even then, I still felt that I was in danger of messing it up. I mustered the energy to ask you to give me a chance. Thankfully, you did.\r\n\r\nNot long after, you eventually cornered me into admitting that if I liked you, we should make it official. I admitted the feelings were genuine. And so it was.\r\n\r\nEven then, I was still afraid that I would find some way of ruining what was to be sure, a great thing. I did anything I could to dance around the dreaded \"L\" word -- using words like \"appreciate\" and \"adore.\" I like to think it was a wise move to take it slow, but we both were too smart to know that it was anything but the word \"love.\"Not long after, the word LOVE was said out loud. I give you credit again. Sensing a pattern?\r\n\r\nEnter the six promises.\r\r\n\nNearly four years ago, you made us swear to keep to six promises. These promises were wide ranging, but in so many ways have come to define our relationship. \r\n\n* We would not laugh at each other. \r\n* We never tell anyone our secrets. \r\n* We never tickle each other. \r\n* We never hit below the belt. \r\n* We will never try to change one another.\r\n\r\n And finally,\r\n* We never stop loving each other.\r\r\n\nI think we should add another to this list of promises.\r\r\n\n Caroline Nicole Kirby, will you promise to share our love with the rest of the world? \n\nYou Know I'm Yours.\r\n\r\n-- David",
  "from": "David", 
  "location": ""
  }